In [1]:
import pandas as pd
import numpy as np
cus_df = pd.read_csv("noahs-customers.csv")

In [2]:
cus_df.head()

,customerid,name,address,citystatezip,birthdate,phone,timezone,lat,long
0,1001,Jacqueline Alvarez,105N Elizabeth St,"Manhattan, NY 10013",1958-01-23,315-377-5031,America/New_York,40.71817,-73.997468
1,1002,Julie Howell,185-1 Linden St,"Brooklyn, NY 11221",1956-12-03,680-537-8725,America/New_York,40.69426,-73.921670
2,1003,Christopher Ali,174-28 Baisley Blvd,"Jamaica, NY 11434",2001-09-20,315-846-6054,America/New_York,40.68902,-73.773470
3,1004,Christopher Rodriguez,102 Mount Hope Pl,"Bronx, NY 10453",1959-07-10,516-275-2292,America/New_York,40.84939,-73.909160
4,1005,Jeffrey Wilkinson,17 St Marks Pl,"Manhattan, NY 10003",1988-09-08,838-830-6960,America/New_York,40.72804,-73.987120

# Night 1
For night one, we're looking for a customer who's lastname matches their phone number. First, let's isolate the lastnames of the customers in a new column.

In [3]:
cus_df['lastname'] = cus_df['name'].str.split().str[-1]

Then, let's clean the columns to make it easier to match them later.

In [5]:
cus_df.lastname = cus_df.lastname.str.lower()
cus_df.phone = cus_df.phone.str.replace('-', '')

After that, map the letters in the last names to the numbers.

In [6]:
key = {'a': '2', 'b': '2', 'c': '2', 'd': '3', 'e': '3', 'f': '3', 'g': '4', 'h': '4', 'i': '4',
       'j': '5', 'k': '5', 'l': '5', 'm': '6', 'n': '6', 'o': '6', 'p': '7', 'q': '7',
       'r': '7', 's': '7', 't': '8', 'u': '8', 'v': '8', 'w': '9', 'x': '9', 'y': '9',
       'z': '9'}
cus_df['lastname'] = cus_df['lastname'].replace(key, regex=True)

Check where the last name and phone numbers match. We have our customer!

In [7]:
cus_df[cus_df['phone']==cus_df['lastname']]

,customerid,name,address,citystatezip,birthdate,phone,timezone,lat,long,lastname
207,1208,Sam Tannenbaum,221 Banker St,"Brooklyn, NY 11222",1994-09-13,8266362286,America/New_York,40.7257,-73.9555,8266362286